-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   skill_res
-- @describe: 物品资源
-- @version:  v1.0
--
local pairs = pairs
local string = string
-------------------------------------------------------------------------------------
-- 物品资源
---@class dungeon_res
local dungeon_res = {
    ['神圣冰川'] = {
        -- 坐标
        x = -1788.349609375, y = 298.337890625, z = 109.9560546875,
        -- 从传送点移动到副本门口所经过的位置(game_unit.get_curr_map_id())
        out_map_list = { 533326.0 },
        -- 副本地图id(game_unit.get_curr_map_id())
        fb_map_id = 1089684.0,
        -- 大地图id(通用)
        map_id = 69068.0,
        -- 传送到最近的地图(game_unit.get_curr_area_id())
        tp_map_id = 533326.0,
        -- 副本英文名
        e_name = 'Portal_Dungeon_Generic',

        END_POS = {
            ['冰川隧道'] = {
                [1] = { x = 89.349609375, y = 19.2685546875, z = 9.1845703125, need_down = true }
            },
            ['浸血冰川'] = {
                [1] = { x = 47.3701171875, y = -1.0107421875, z = 0.88671875, putong = true,map = '浸血冰川A' },
                [2] = { x = 1.9072265625, y = 47.1455078125, z = 0.0615234375, putong = true ,map = '浸血冰川B' },
                [3] = { x = -12.76171875, y = 113.759765625, z = 0.0615234375, putong = true ,map = '浸血冰川C' },
                [4] = { x = 47.0791015625, y = 126.9638671875, z = 0.0615234375, putong = true ,map = '浸血冰川D' },
                [5] = { x = 68.630859375, y = 80.169921875, z = 0.0615234375, end_map = true,map = '浸血冰川E' },


            },
        },
    },
    ['奥杜尔的洞穴'] = {
        -- 副本门口坐标
        x = 386.5654296875, y = -626.4677734375, z = 10.4599609375,
        -- 从传送点移动到副本门口所经过的位置(game_unit.get_curr_map_id())
        --TODO  out_map_list = { 533326.0 },
        -- 副本地图id(game_unit.get_curr_map_id())
        --TODO  fb_map_id = 1089684.0,
        -- 大地图id(通用)
        map_id = 69068.0,
        -- 传送到最近的地图(game_unit.get_curr_area_id())
        tp_map_id = 747179.0,
        -- 副本英文名
        e_name = 'Portal_Dungeon_Generic',

        END_POS = {
            type_one = {x = 39.0185546875, y = 46.9833984375, z = 2.1572265625,}
        },
    },

}
local this = dungeon_res

-------------------------------------------------------------------------------------
-- 返回对象
return dungeon_res

-------------------------------------------------------------------------------------