------------------------------------------------------------------------------------
-- game/resources/ui_res.lua
--
--
--
-- @module      ui_res
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local ui_res = import('game/resources/ui_res')
------------------------------------------------------------------------------------
--- @class equip_res
local equip_res = {
    tItemInfo = {
        ['物品强度'] = { ID = -0xFFFFFE8A, desc = '物品强度', int = true },
        ['命中伤害幅度'] = { ID = 0xFFFFFFFF00000180, desc = '命中伤害幅度', int = true },
        ['力量'] = { ID = 0xFFFFFFFF00000002, desc = '力量', float = true, mul = 1 },
        ['力量'] = { ID = 0xFFFFFFFF00000003, desc = '智力', float = true, mul = 1 },
        ['意力'] = { ID = 0xFFFFFFFF00000004, desc = '意力', float = true, mul = 1 },
        ['基础护甲'] = { ID = 0xFFFFFFFF00000185, desc = '基础护甲', int = true },
        ['当前护甲'] = { ID = 0xFFFFFFFF00000186, desc = '当前护甲', int = true },
        ['总护甲'] = { ID = 0xFFFFFFFF00000189, desc = '+总护甲', float = true, mul = 100 },
        ['力量百分比'] = { ID = 0xFFFFFFFF0000000B, desc = '+力量百分比', float = true, mul = 100 },
        ['智力百分比'] = { ID = 0xFFFFFFFF0000000C, desc = '+智力百分比', float = true, mul = 100 },
        ['意力百分比'] = { ID = 0xFFFFFFFF0000000D, desc = '+意力百分比', float = true, mul = 100 },
        ['敏捷百分比'] = { ID = 0xFFFFFFFF0000000E, desc = '+敏捷百分比', float = true, mul = 100 },
        ['怒气消耗减免'] = { ID = 0x000000010000008F, desc = '怒气消耗减免', float = true, mul = 100 },
        ['装备磨损度'] = { ID = 0xFFFFFFFF00000166, desc = '装备磨损度', float = true, mul = 100 },
        ['对击晕敌人的伤害'] = { ID = 0x0000000200000313, desc = '对击晕敌人的伤害', float = true, mul = 100 },
        ['装备等级'] = { ID = 0x0000002500000169, desc = '装备等级', float = true, mul = 1 },
        ['对被控敌人的伤害'] = { ID = 0xFFFFFFFF00000315, desc = '+对被控敌人的伤害', float = true, mul = 100 },
        ['对流血敌人的伤害'] = { ID = 0x0000000000000316, desc = '+对流血敌人的伤害', float = true, mul = 100 },
        ['受伤时药水移动速度加成'] = { ID = 0xFFFFFFFF00000217, desc = '受伤时药水移动速度加成', float = true, mul = 100 },
        ['躲闪几率'] = { ID = 0xFFFFFFFF00000116, desc = '躲闪几率', float = true, mul = 100 },
        ['镶嵌宝石数量'] = { ID = 0xFFFFFFFF0000016D, desc = '镶嵌宝石数量', int = true },
        ['需要切换武器的技能的伤害'] = { ID = 0xFFFFFFFF0000031A, desc = '+需要切换武器的技能的伤害', float = true, mul = 100 },
        ['近距敌人的伤害减免'] = { ID = 0xFFFFFFFF0000039B, desc = '近距敌人的伤害减免', float = true, mul = 100 },
        ['流血敌人的伤害减免'] = { ID = 0x000000000000031C, desc = '流血敌人的伤害减免', float = true, mul = 100 },
        ['插槽数量'] = { ID = 0xFFFFFFFF0000016C, desc = '插槽数量', int = true },
        ['药水数量'] = { ID = 0xFFFFFFFF0000020E, desc = '药水数量', int = true },
        ['对受伤敌人的伤害'] = { ID = 0xFFFFFFFF0000039F, desc = '+对受伤敌人的伤害', float = true, mul = 100 },
        ['所有防御技能'] = { ID = 0xD2F964BA000003C1, desc = '+所有防御技能', int = true },
        ['对健康敌人的伤害'] = { ID = 0xFFFFFFFF000003A1, desc = '+对健康敌人的伤害', float = true, mul = 100 },
        ['威能2'] = { ID = 0x0008D51D000003D2, desc = '威能2', float = true, mul = 100 },
        ['受伤状态下的伤害减免'] = { ID = 0xFFFFFFFF000003A3, desc = '受伤状态下的伤害减免', float = true, mul = 100 },
        ['残暴之力被动'] = { ID = 0x000349DF000003BE, desc = '残暴之力被动', int = true },
        ['使用双手钝击武器的伤害'] = { ID = 0x000E94EA000000D6, desc = '使用双手钝击武器的伤害', float = true, mul = 100 },
        ['大地践踏'] = { ID = 0x0002D7F6000003C0, desc = '大地践踏', int = true },
        ['伤害减免'] = { ID = 0xFFFFFFFF000003A7, desc = '+伤害减免', float = true, mul = 100 },
        ['冲锋'] = { ID = 0x00031F76000003C0, desc = '冲锋', int = true },
        ['控制受限时间缩短'] = { ID = 0xFFFFFFFF00000129, desc = '控制受限时间缩短', float = true, mul = 100 },
        ['减速持续时间缩减'] = { ID = 0x000000000000012A, desc = '减速持续时间缩减', float = true, mul = 100 },
        ['沙石飞扬'] = { ID = 0x000316F4000003C0, desc = '沙石飞扬', int = true },
        ['移动速度'] = { ID = 0xFFFFFFFF000000AC, desc = '+移动速度', float = true, mul = 100 },
        ['集结呐喊'] = { ID = 0x00033BE2000003C0, desc = '集结呐喊', int = true },
        ['钢铁之肤'] = { ID = 0x0007D0DE000003C0, desc = '钢铁之肤', int = true },
        ['狂乱'] = { ID = 0x000337E7000003C0, desc = '狂乱', int = true },
        ['踢击'] = { ID = 0x00030B5C000003C0, desc = '踢击', int = true },
        ['战吼'] = { ID = 0x0002D118000003C0, desc = '战吼', int = true },
        ['腾空斩'] = { ID = 0x0002FFC1000003C0, desc = '腾空斩', int = true },
        ['旋风斩'] = { ID = 0x00032663000003C0, desc = '旋风斩', int = true },
        ['荆棘'] = { ID = 0xFFFFFFFF00000134, desc = '荆棘', float = true, mul = 1 },
        ['狂暴的持续时间'] = { ID = 0x0003433400000335, desc = '狂暴的持续时间', float = true, mul = 100 },
        ['痛割'] = { ID = 0x00034702000003C0, desc = '痛割', int = true },
        ['攻击速度'] = { ID = 0xFFFFFFFF000000B7, desc = '+攻击速度', float = true, mul = 100 },
        ['先祖之锤'] = { ID = 0x000342A9000003C0, desc = '先祖之锤', int = true },
        ['双重横扫'] = { ID = 0x00032C80000003C0, desc = '双重横扫', int = true },
        ['割裂'] = { ID = 0x000347F3000003C0, desc = '割裂', int = true },
        ['割裂冷却时间缩减'] = { ID = 0x000347F3000000C3, desc = '割裂冷却时间缩减', float = true, mul = 100 },
        ['受到的治疗百分比'] = { ID = 0xFFFFFFFF0000003C, desc = '+受到的治疗百分比', float = true, mul = 100 },
        ['使用双手劈砍武器的伤害'] = { ID = 0x000E94E9000000D6, desc = '使用双手劈砍武器的伤害', float = true, mul = 100 },
        ['坚如钢钉被动'] = { ID = 0x00034405000003BE, desc = '坚如钢钉被动', int = true },
        ['火焰抗性'] = { ID = 0x0000000100000043, desc = '火焰抗性', float = true, mul = 100 },
        ['基础技能攻击速度'] = { ID = 0xC71462A3000000C0, desc = '基础技能攻击速度', float = true, mul = 100 },
        ['所有武器精通技能'] = { ID = 0x85A2478F000003C1, desc = '+所有武器精通技能', int = true },
        ['毒素抗性'] = { ID = 0x0000000400000043, desc = '毒素抗性', float = true, mul = 100 },
        ['消灭获得生命'] = { ID = 0xFFFFFFFF00000143, desc = '消灭获得生命', float = true, mul = 1 },
        ['冷却时间缩减'] = { ID = 0xFFFFFFFF000000C4, desc = '冷却时间缩减', float = true, mul = 100 },
        ['全元素抗性'] = { ID = 0xFFFFFFFF00000045, desc = '全元素抗性', float = true, mul = 100 },
        ['威能伤害'] = { ID = 0x0008D51D000003D0, desc = '威能伤害', float = true, mul = 100 },
        ['受伤时药水恢复资源'] = { ID = 0xFFFFFFFF00000216, desc = '受伤时药水恢复资源', int = true },
        ['受伤时药水提供生命上限的屏障'] = { ID = 0xFFFFFFFF00000215, desc = '受伤时药水提供生命上限的屏障', float = true, mul = 100 },
        ['幸运一击几率'] = { ID = 0xFFFFFFFF000003E5, desc = '幸运一击几率', float = true, mul = 100 },
        ['幸运一击:几率恢复主要资源'] = { ID = 0xFFFFFFFF0000013C, desc = '幸运一击:几率恢复主要资源', float = true, mul = 100 },
        ['对近距敌人的伤害'] = { ID = 0xFFFFFFFF00000393, desc = '+对近距敌人的伤害', float = true, mul = 100 },
        ['怒气上限'] = { ID = 0x0000000100000082, desc = '+怒气上限', float = true, mul = 1 },
        ['暗影抗性'] = { ID = 0x0000000500000043, desc = '暗影抗性', float = true, mul = 100 },
        ['持续性伤害'] = { ID = 0xFFFFFFFF0000024E, desc = '持续性伤害', float = true, mul = 100 },
        ['物理持续性伤害'] = { ID = 0x000000000000024F, desc = '物理持续性伤害', float = true, mul = 100 },
        ['物理伤害'] = { ID = 0x00000000000000D0, desc = '物理伤害', float = true, mul = 100 },
        ['威能1'] = { ID = 0x0008D51D000003D1, desc = '威能1', float = true, mul = 100 },
        ['非物理伤害'] = { ID = 0xFFFFFFFF000000D2, desc = '非物理伤害', float = true, mul = 100 },
        ['冰霜抗性'] = { ID = 0x0000000300000043, desc = '冰霜抗性', float = true, mul = 100 },
        ['武器精通技能伤害'] = { ID = 0x85A2478F000000D4, desc = '+武器精通技能伤害', float = true, mul = 100 },
        ['闪电抗性'] = { ID = 0x0000000200000043, desc = '闪电抗性', float = true, mul = 100 },
        ['使用双持武器的伤害'] = { ID = 0x000E94E5000000D6, desc = '使用双持武器的伤害', float = true, mul = 100 },
        ['基础技能伤害'] = { ID = 0xC71462A3000000D4, desc = '+基础技能伤害', float = true, mul = 100 },
        ['搏斗技能伤害'] = { ID = 0x884FC4F7000000D4, desc = '+搏斗技能伤害', float = true, mul = 100 },
        ['最大闪避次数'] = { ID = 0xFFFFFFFF0000036B, desc = '+最大闪避次数', int = true },
        ['消灭精英后伤害持续时间'] = { ID = 0xFFFFFFFF000002FF, desc = '消灭精英后伤害持续时间', float = true, mul = 1 },
        ['伤害在消灭一个精英怪后'] = { ID = 0xFFFFFFFF000002FE, desc = '+伤害在消灭一个精英怪后', float = true, mul = 100 },
        ['敏捷'] = { ID = 0xFFFFFFFF00000005, desc = '敏捷', float = true, mul = 1 },
        ['全属性'] = { ID = 0xFFFFFFFF00000006, desc = '全属性', float = true, mul = 1 },
        ['控制持续时间'] = { ID = 0xFFFFFFFF00000127, desc = '控制持续时间', float = true, mul = 100 },
        ['暴击几率'] = { ID = 0xFFFFFFFF000000DF, desc = '暴击几率', float = true, mul = 100 },
        ['物品品级'] = { ID = 0xFFFFFFFF00000160, desc = '物品品级', int = true },
        ['物品质量'] = { ID = 0xFFFFFFFF00000162, desc = '物品品级', int = true },
        ['幸运一击:几率迷惑'] = { ID = 0x00000007000002F6, desc = '幸运一击:几率迷惑', float = true, mul = 100 },
        ['幸运一击:几率定身'] = { ID = 0x00000001000002F6, desc = '幸运一击:几率定身', float = true, mul = 100 },
        ['幸运一击:几率减速'] = { ID = 0x00000000000002F6, desc = '幸运一击:几率减速', float = true, mul = 100 },
        ['幸运一击:几率恢复生命'] = { ID = 0xFFFFFFFF0000030C, desc = '幸运一击:几率恢复生命', float = true, mul = 100 },
        ['易伤伤害'] = { ID = 0xFFFFFFFF00000265, desc = '易伤伤害', float = true, mul = 100 },
        ['对受伤敌人的暴击几率'] = { ID = 0xFFFFFFFF000000E6, desc = '对受伤敌人的暴击几率', float = true, mul = 100 },
        ['伤害百分比'] = { ID = 0xFFFFFFFF000000CE, desc = '+伤害百分比', float = true, mul = 100 },
        ['暴击伤害'] = { ID = 0xFFFFFFFF000000E8, desc = '暴击伤害', float = true, mul = 100 },
        ['强固时伤害减免'] = { ID = 0xFFFFFFFF00000269, desc = '强固时伤害减免', float = true, mul = 100 },
        ['强固生成量'] = { ID = 0xFFFFFFFF0000026A, desc = '强固生成量', float = true, mul = 100 },
        ['生命上限'] = { ID = 0xFFFFFFFF0000006B, desc = '+生命上限', float = true, mul = 1 },
        ['攻击使闪避的冷却时间缩短'] = { ID = 0xFFFFFFFF0000036C, desc = '攻击使闪避的冷却时间缩短', float = true, mul = 100 },
        ['闪避获得移动速度'] = { ID = 0xFFFFFFFF0000036D, desc = '闪避获得移动速度', float = true, mul = 100 },
        ['终极技能伤害'] = { ID = 0x6EAA3D26000000D4, desc = '+终极技能伤害', float = true, mul = 100 },
        ['核心技能伤害'] = { ID = 0xA8F1E20A000000D4, desc = '+核心技能伤害', float = true, mul = 100 },
        ['屏障生成'] = { ID = 0xFFFFFFFF000003F6, desc = '屏障生成', float = true, mul = 100 },
        ['当狂暴时伤害'] = { ID = 0x000343340000031B, desc = '当狂暴时伤害', float = true, mul = 100 },
        ['近期未受任何伤害时的生命回复速度'] = { ID = 0xFFFFFFFF0000021B, desc = '近期未受任何伤害时的生命回复速度', float = true, mul = 1 },
        ['药水掉落率'] = { ID = 0xFFFFFFFF00000213, desc = '药水掉落率', float = true, mul = 100 },
        ['物品基础强度'] = { ID = 0xFFFFFFFF00000174, desc = '物品基础强度', int = true },
        ['物品强化后提升强度值'] = { ID = 0xFFFFFFFF00000175, desc = '物品强化后提升强度值', int = true },
        ['物品当前强度'] = { ID = 0xFFFFFFFF00000176, desc = '物品当前强度', int = true },
        ['强化等级'] = { ID = 0xFFFFFFFF00000177, desc = '强化等级', int = true },
        ['圣坛增益持续时间'] = { ID = 0xFFFFFFFF000003F8, desc = '圣坛增益持续时间', float = true, mul = 100 },
        ['远距敌人的伤害减免'] = { ID = 0xFFFFFFFF0000039C, desc = '远距敌人的伤害减免', float = true, mul = 100 },
        ['对减速敌人的伤害'] = { ID = 0x0000000000000313, desc = '对减速敌人的伤害', float = true, mul = 100 },
        ['幸运一击:斩杀受伤的非精英怪几率'] = { ID = 0xFFFFFFFF000002FB, desc = '幸运一击:斩杀受伤的非精英怪几率', float = true, mul = 100 },
        ['移动速度在消灭一个精英怪后'] = { ID = 0xFFFFFFFF000002FC, desc = '+移动速度在消灭一个精英怪后', float = true, mul = 100 },
        ['消灭精英后移动速度持续时间'] = { ID = 0xFFFFFFFF000002FD, desc = '消灭精英后移动速度持续时间', float = true, mul = 1 },
        ['压制伤害'] = { ID = 0xFFFFFFFF000000FE, desc = '压制伤害', float = true, mul = 100 },
        ['命中伤害初始值'] = { ID = 0xFFFFFFFF0000017F, desc = '命中伤害初始值', int = true },
    },


    EQUIP_ATTR = {
        ['野蛮人'] = {
            -- 武器
            ['双手锤'] = {
                -- 强制属性
                manda_attr = {
                    '暴击伤害',
                    '易伤伤害',
                },
                -- 优先属性
                pre_attr = {
                    '全属性',
                    '核心技能伤害',
                    '对近距敌人的伤害',
                }
            },
            ['剑'] = {
                -- 强制属性
                manda_attr = {
                    '暴击伤害',
                    '易伤伤害',
                },
                -- 优先属性
                pre_attr = {
                    '全属性',
                    '核心技能伤害',
                    '对近距敌人的伤害',
                }
            },
            ['双手剑'] = {
                -- 强制属性
                manda_attr = {
                    '暴击伤害',
                    '易伤伤害',
                },
                -- 优先属性
                pre_attr = {
                    '全属性',
                    '核心技能伤害',
                    '对近距敌人的伤害',
                }
            },
            --戒指
            ['戒指'] = {
                manda_attr = {
                    '暴击伤害',
                    '易伤伤害',
                    '暴击几率',
                },
                pre_attr = {
                    '怒气上限',
                    -- '资源生成',
                }
            },
            -- 项链
            ['护符'] = {
                manda_attr = {
                    '怒气消耗减免',
                    '冷却时间缩减',

                },
                pre_attr = {
                    '所有防御技能',
                    '近距敌人的伤害减免',
                    '移动速度',
                }
            },
            -- 鞋子
            ['长靴'] = {
                manda_attr = {
                    '移动速度',
                    '怒气消耗减免',
                },
                pre_attr = {
                    '全属性',
                    '近距敌人的伤害减免',
                }
            },
            -- 裤子
            ['裤子'] = {
                manda_attr = {
                    '近距敌人的伤害减免',
                    '伤害减免',
                    '强固时伤害减免',
                    '远距敌人的伤害减免'
                },
                pre_attr = {

                }
            },
            -- 手套
            ['手套'] = {
                manda_attr = {
                    '先祖之锤',
                    '暴击几率',
                },
                pre_attr = {
                    '攻击速度',
                    '幸运一击几率',
                    '幸运一击:几率恢复主要资源',
                }
            },
            -- 胸甲
            ['上衣'] = {
                manda_attr = {

                },
                pre_attr = {
                    -- '挑战怒吼等级',
                    '近距敌人的伤害减免',
                    '伤害减免',
                    '强固时伤害减免',
                    '远距敌人的伤害减免',
                    '总护甲',
                }
            },
            -- 头盔
            ['头盔'] = {
                manda_attr = {
                    '冷却时间缩减',
                    '怒气上限',
                },
                pre_attr = {
                    '近距敌人的伤害减免',
                    '伤害减免',
                    '强固时伤害减免',
                    '远距敌人的伤害减免',
                    '总护甲',
                    '生命上限',
                }
            },
        },
    },

    EQUIP_TYPE = {


        ['1HAxe'] = '单手斧',
        ['2HAxe'] = '双手斧',
        ['1HSword'] = '单手剑',
        ['2HSword'] = '双手剑',
        ['1HMace'] = '单手锤',
        ['2HMace'] = '双手锤',
        ["Helm"] = '头盔',
        ["Chest"] = '上衣',
        ["Gloves"] = '手套',
        ["Pants"] = '裤子',
        ["Boots"] = '长靴',
        ["Amulet"] = '项链',
        ["Ring"] = '戒指',
        ["2HPolearm"] = '长柄武器',
        ['1HShield'] = '盾'
        --装备类型无法确认1HWand_Rare_Sorc_Crafted_33
        --装备类型无法确认2HStaff_Rare_Sorc_Crafted_31
        --装备类型无法确认1HWand_Rare_Sorc_Crafted_49

        --
        ---- 头盔
        --['高地头环'] = '头盔',
        --['毛皮内衬兜帽'] = '头盔',
        --['重盔'] = '头盔',
        --['头盔'] = '头盔',
        --['风化帽'] = '头盔',
        --['阔步者王冠'] = '头盔',
        --['流浪者软帽'] = '头盔',
        --['华美兜帽'] = '头盔',
        --['坚固兜帽'] = '头盔',
        --['骨织头盔'] = '头盔',
        --['流浪者头盔'] = '头盔',
        --['巫师会兜帽'] = '头盔',
        --['冒险者头盔'] = '头盔',
        ---- 靴子
        --['重靴'] = '长靴',
        --['皮靴'] = '长靴',
        --['风化靴子'] = '长靴',
        --['流浪者靴'] = '长靴',
        --['华美靴子'] = '长靴',
        --['坚固靴子'] = '长靴',
        --['沙化鞋'] = '长靴',
        --['毛皮长靴'] = '长靴',
        --['冒险者靴'] = '长靴',
        --['阔步者鞋履'] = '长靴',
        --['巫师会便鞋'] = '长靴',
        --['高地靴子'] = '长靴',
        --['步行靴'] = '长靴',
        --['骨织靴子'] = '长靴',
        ---- 裤子
        --['重裤子'] = '裤子',
        --['衬皮裤子'] = '裤子',
        --['华美裤子'] = '裤子',
        --['骨织裙甲'] = '裤子',
        --['裤子'] = '裤子',
        --['坚固裤子'] = '裤子',
        --['流浪者裤子'] = '裤子',
        --['巫师会短裤'] = '裤子',
        --['阔步者腿甲'] = '裤子',
        --['风化马裤'] = '裤子',
        --['皮裤'] = '裤子',
        --['督军板甲'] = '裤子',
        --['原始紧身马裤'] = '裤子', --保护者之原始紧身马裤
        ---- 手套
        --['沙化裹手'] = '手套',
        --['重手套'] = '手套',
        --['风化手套'] = '手套',
        --['华美手套'] = '手套',
        --['坚固手套'] = '手套',
        --['巫师会手套'] = '手套',
        --['毛皮内衬手套'] = '手套',
        --['督军护手'] = '手套',
        --['流浪者手套'] = '手套',
        --['阔步者裹手'] = '手套',
        --['高地裹手'] = '手套',
        --['手套'] = '手套',
        --['皮手套'] = '手套',
        --['护手'] = '手套',
        ---- 上衣
        --['衬皮长袍'] = '上衣',
        --['阔步者短衣'] = '上衣',
        --['流浪者短衣'] = '上衣',
        --['华美短衣'] = '上衣',
        --['坚固短衣'] = '上衣',
        --['皮制紧身上衣'] = '上衣',
        --['高地背心'] = '上衣',
        --['原始胸甲'] = '上衣',
        --['巫师会法衣'] = '上衣',
        --['短衣'] = '上衣',
        --['沙化上衣'] = '上衣',
        ---- 护符
        --['护符'] = '护符',
        --['白骨神符'] = '护符',
        --['卡尔丁护盘'] = '护符',
        --['圣光教纹章'] = '护符',
        --['邪眼'] = '护符',
        --['德鲁伊神符'] = '护符',
        --['项链'] = '护符',
        --['项圈'] = '护符',
        --['战争纹章'] = '护符', --碎颅者的战争纹章
        ---- 戒指
        --['戒指'] = '戒指',
        --['符文指环'] = '戒指',
        --['雕刻指环'] = '戒指',
        --['德鲁伊徽戒'] = '戒指',
        --['平原指环'] = '戒指',
        --['青金石护戒'] = '戒指', --神旨圣所
        --['指环'] = '戒指', --心如止水之指环
        --['指圈'] = '戒指', --骄狂指圈
        --['圣母的拥抱'] = '戒指', --圣母的拥抱
        ---- 武器
        --['风化弓'] = '弓',
        --['锤'] = '锤',
        --['流星锤'] = '锤',
        --['战斗斧'] = '斧头',
        --['铁斧'] = '双手斧',
        --['末日之刃'] = '剑',
        --['短剑'] = '剑',
        --['远击'] = '弓',
        --['锯齿切肉斧'] = '双手斧',
        --['大剑'] = '剑',
        --['迅捷之风'] = '弩',
        --['伐木斧'] = '双手斧',
        --['决斗魔杖'] = '魔杖',
        --['防身盾'] = '盾',
        --['战锤'] = '双手锤',
        --['大棒'] = '锤',
        --['橡木魔杖'] = '魔杖',
        --['细剑'] = '剑',
        --['森林战斧'] = '双手斧',
        --['标枪'] = '长柄武器',
        --['哥特杖'] = '杖',
        --['铁头锤'] = '双手锤',
        --['穿刺者'] = '长柄武器',
        --['铁拐杖'] = '杖',
        --['死亡钉锤'] = '锤',
        --['铁甲小圆盾'] = '盾',
        --['弯刃剑'] = '剑',
        --['高地大剑'] = '双手剑',
        --['双刃斧'] = '双手斧',
        --['钉棍'] = '锤',
        --['长柄大锤'] = '双手锤',
        --['重型巨剑'] = '双手剑',
        --['狂徒剑'] = '剑',
        --['巨斧'] = '双手斧',
        --['双手锤'] = '双手锤',
        --['重型巨剑'] = '双手剑',
        --['大槌'] = '双手锤',
        --['攻城弩'] = '弩',
        --['焰形剑'] = '双手剑',
        --['钉锤'] = '锤',
        --['倒钩斧'] = '斧头',
        --['战斧'] = '斧头',
        --['弑君者'] = '双手剑',
        --['血弧'] = '双手斧',
        --['长柄斧'] = '双手斧',
        --['重斧'] = '双手斧',
        --['槌'] = '双手锤',
        --['焰刃剑'] = '剑',
        --['长柄枪'] = '长柄武器',
        --['残伤者'] = '剑',
        --['萨加里斯战斧'] = '双手斧',
        --['重胸甲'] = '上衣',
        --['高地弓'] = '弓',
        --['铁槌'] = '双手锤',
        --['长刀'] = '剑',
        --['碎颅锤'] = '双手锤',
        --['尖刺棒'] = '锤',
        --['鸢盾'] = '盾',
        --['手半剑'] = '双手剑',
        --['开膛斧'] = '斧头',
        --['非凡弓'] = '弓',
        --['罗摩斧'] = '双手斧',
        --['陪葬魔杖'] = '魔杖',
        --['大锤'] = '双手锤',
        --['战争剑'] = '剑',
        --['恐怖钉锤'] = '双手锤',
        --['鬼魂制造者'] = '弩',
        --['倒钩剑'] = '剑',
        --['阔刃剑'] = '剑',
        --['硫磺剑'] = '双手剑',
        --['高地长裤'] = '裤子',
        --['风化短衣'] = '上衣',
        --['命运'] = '长柄武器',
        --['阔斧'] = '斧头',
        --['逆刃剑'] = '双手剑',
        --['造王者'] = '双手斧',
        --['重盾'] = '盾',
        --['食人族切肉斧'] = '双手斧',
        --['作战盾'] = '盾',
        --['大盾'] = '盾',
        --['哥特盾'] = '盾',
        --['保护者盾'] = '盾',
        --['精良盾牌'] = '盾',
        --['重弩'] = '弩',
        --['非凡弩'] = '弩',
        --['导师魔杖'] = '魔杖',
        --['尸妖魔杖'] = '魔杖',
        --['代用魔杖'] = '魔杖',
        --['基础魔杖'] = '魔杖',
        --['双手剑'] = '双手剑',
        --['平板弓'] = '弓',
        --['脊剑'] = '双手剑',
        --['大型斧'] = '双手斧',
        --['沙化马裤'] = '裤子',
        --['沙化帽'] = '头盔',
        --['大型斧'] = '双手斧',
        --['铁头战锤'] = '双手锤',
        --['军镐'] = '斧头',
        --['战痕新月斧'] = '双手斧',
        --['军剑'] = '剑',
        --['遗忘之剑'] = '剑',
        --['雪松木斧'] = '斧头',
        --['木棒'] = '锤',
        --['手斧'] = '斧头',
        --['战士盾'] = '盾',
        --['西米塔弯刀'] = '剑',
        --['破坏者'] = '双手锤',
        --['巫妖之刃'] = '剑',
        --['钢魔杖'] = '魔杖',
        --['符文杖'] = '杖',
        --['巨剑'] = '双手剑',
        --['碎骨者'] = '双手锤',
        --
        --['砍斧'] = '双手斧',
        --['大头棒'] = '锤子',
        --['统治者头盔'] = '头盔',
        --['钉头锤'] = '双手锤',
        --['根拳'] = '锤',
        --['冒险者短衣'] = '上衣',
        --
        --
        --['冒险者手套'] = '手套',
        --['角斗剑'] = '剑',
        --['袖剑'] = '剑',
        --['大斧'] = '斧',
        --['骇人钉锤'] = '双手锤',
        --['掠夺斧'] = '斧头',
        --['袖剑'] = '剑',
        --['骑枪'] = '长柄武器',
        --['符文钉鞋'] = '靴子',
        --['骑枪'] = '长柄武器',
        --['斩风'] = '双手斧',
        --['角斗剑'] = '剑',
        --['君王臂甲'] = '手套',
        --['基础大剑'] = '双手剑',
        --['哥特剑'] = '双手剑', --魔导师的破坏者
        --['长剑'] = '剑', --长剑
        --['长斧'] = '长柄武器', --长斧
        --['铁盾'] = '盾', --凶恶铁壁
        --['塔盾'] = '盾', --灵体结界
        --['幽灵魔杖'] = '魔杖', --经久羽饰
        --['四分杖'] = '杖', --施法者的开端
        --['八爪斧'] = '斧头', --地震八爪斧
        --['蟒噬'] = '剑', --心如止水之蟒噬
        --['斧'] = '双手斧', --斧
        --['粗制魔杖'] = '魔杖', --断头台之残忍粗制魔杖
        --['部族法杖'] = '杖', --密法打击
        --['铁魔杖'] = '魔杖', --法师的崛起
        --['魔导师魔杖'] = '魔杖', --英勇金棒
        --['白银翘曲弓'] = '弓', --凶魔藤弓
        --['遗忘之弓'] = '弓', --割裂夺魂者
        --['劳工锤'] = '双手锤', --处决之偷猎者的劳工锤
        --['哈洛加斯之怒'] = '上衣', --哈洛加斯之怒
        --
        --['月刃斧'] = '斧头', --风笞之月刃斧
        --['尖角法杖'] = '杖', --尖角法杖
        --['斧枪'] = '长柄武器', --斧枪
        --['狼噬'] = '锤', --加速狼噬
        --['厄运腿甲'] = '裤子', --偏转屏障之厄运腿甲
        --
        --['龙杖'] = '杖', --知识武装
        --['剑刃戟'] = '长柄武器', --步兵的损耗
        --['皇家骨剑'] = '剑', --魔怒皇家骨剑
        --['颅与钢'] = '剑', --破地者的颅与钢
        --['学员魔杖'] = '魔杖', --残忍之巅峰学员魔杖
        --['原始护手'] = '手套', --贫血之原始护手
        --['切割斧'] = '斧', --处决之回击切割斧
        --['戟枪'] = '长柄武器', --暴烈之滞留戟枪
        --['切割斧'] = '斧', --处决之回击切割斧
        --['统治者杖'] = '杖', --贤者的折磨者
        --['复合弩'] = '弩', --割裂黎明
        --['阔剑'] = '剑', --断头台之偷猎者的阔剑
        --['督军腿甲'] = '裤子', --麻木愠怒之督军腿甲
        --['君王护胫'] = '靴子', --袭风者君王护胫
        --['杖棍'] = '杖', --杖棍
        --['战争杖'] = '杖', --黑魔法赏金
        --['锁链'] = '护符', --回火打击之锁链
        --['代用弓'] = '弓', --腐灼之巅峰代用弓
        --['魔剑'] = '双手剑', --魔怒魔剑
        --['黑曜石杖'] = '杖', --白骨云杉杖
        --['长杖'] = '杖', --勋爵的棍子
        --['召法魔杖'] = '魔杖', --白骨云杉杖
        --['残酷魔杖'] = '魔杖', --勋爵的棍子
        --['无声之弦'] = '魔杖', --无声之弦
        --['粗糙锤'] = '双手锤', --处决之抹灭粗糙锤
        --['督军长靴'] = '靴子', --抓力旋风之督军长靴
        --['萨加里斯斧'] = '双手斧', --死亡之愿萨加里斯斧
        --['冲击锤'] = '锤', --魔怒冲击锤
        --['原始轻钢盔'] = '头盔', --共难之原始轻钢盔
        --['长老法杖'] = '杖', --学士的手段
        --['石像鬼大剑'] = '双手剑', --急促石像鬼大剑
        --['反曲铁弓'] = '弓', --腐灼之惊怵反曲铁弓
        --['大地法杖'] = '杖', --奥法指令
        --['战斗杖'] = '杖', --至高天灾星
        --['钢铁卫士'] = '剑', --偷猎之断头台钢铁卫士
        --['猎弓'] = '弓', --滞留之残忍猎弓
        --['悔罪之锤 '] = '双手锤', --加速悔罪之锤
        --['亡者之御'] = '盾', --军团士兵拥抱
        --['符文手套'] = '手套', --恐怖旋风之符文手套
        --['黑曜石剑'] = '剑', --风笞之黑曜石剑
        --['复合杖'] = '杖', --毒蛇鹤杖
        --['风化杖'] = '杖', --腐蚀柱子
        --['尖角大棒'] = '双手锤', --破地者的尖角大棒
        --['剃刀之风'] = '弓', --星辰惊风
        --['统治者胸甲'] = '上衣', --鲁莽狂战之统治者胸甲
        --['皮短衣'] = '上衣', --皮短衣
        --['统治者护胫'] = '靴子', --贫血之统治者护胫
        --['骨织护手'] = '手套', --幸运使者骨织护手
        --['野猪矛'] = '长柄武器', --和谐野猪矛
        --['符文锁甲'] = '上衣', --保护符文锁甲
        --['靴刀'] = '靴子', --和谐之偷猎者的靴刀
        --['雪松杖'] = '杖', --雪松杖
        --['君王头盔'] = '头盔', --簇拥智者之君王头盔
        --['魔杖'] = '魔杖', --大师复仇
        --['统治者护手'] = '手套', --拳师的统治者护手
        --['吸血锤'] = '锤', --先祖回响之吸血锤
        --['巨弩'] = '弩', --割裂结界
        --['食尸鬼王之刃'] = '剑', --战斗狂食尸鬼王之刃
        --['碎颅者'] = '锤', --死亡之愿碎颅者
        --['拉玛兰迪的杰作'] = '剑', --拉玛兰迪的杰作
        --['水晶大剑'] = '双手剑', --惩击水晶大剑
        --['坚固法杖'] = '杖', --处决之回击坚固法杖
        --['虐杀'] = '双手锤', --虐杀
        --['冷钢弓'] = '弓', --恶毒追风
        --['君王裙甲'] = '裤子', --违抗之君王裙甲
        --['坚固法杖'] = '杖', --精准霹雳之偷猎者的坚固法杖


    },
    SAVE_EQUIP = {
        '祖父',
        '塞利格的溶解之心',
        '无星夜空之戒',
        '末日使者',
        '谐角之冠',
        '安达莉尔的仪容',
        '屠夫的砍斧',

        '麻木',
        '加速',
        '保护者',
        '剥削者',
        '违抗',
        '怒火回荡',
        '无畏酋长',
        '无尽怒火',
        '先祖力量',
        '优势大师',
        '蓄势威能',
        '勇力',
    },
    QZ_SAVE_EQUIP = {
        '祖父',
        '塞利格的溶解之心',
        '无星夜空之戒',
        '末日使者',
        '谐角之冠',
        '安达莉尔的仪容',
    },
    NEED_EQUIP = {
        ['野蛮人'] = {
            ['头盔'] = true,
            ['裤子'] = true,
            ['长靴'] = true,
            ['裤子'] = true,
            ['手套'] = true,
            ['上衣'] = true,
            ['护符'] = true,
            ['戒指'] = true,

            ['双手锤'] = true,
            ['双手剑'] = true,
            ['剑'] = true,

        },
    },

}

-- 自身模块
local this = equip_res


-- 判断是否为箱子
function equip_res.get_eqyip_type_by_e_name(e_name)
    local equip_type = ''
    for k, v in pairs(equip_res.EQUIP_TYPE) do
        if string.find(e_name, k) then
            equip_type = v
            break
        end
    end
    return equip_type
end

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return equip_res

-------------------------------------------------------------------------------------