-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   login_res
-- @describe: 登陆模块用到的资源
-- @version:  v1.0
--
local game_unit = game_unit
-------------------------------------------------------------------------------------
-- 登陆模块资源
---@class login_res
local login_res = {
    STATUS_INTRO_PAGE   = 16384,    --进入游戏时的启动页面
    STATUS_IN_GAME      = 1048576,  -- 游戏界面
    STATUS_PASS_MAP     = 0,        -- 过图
    STATUS_OTHER        = 1,        -- 其他


}

local this = login_res

-------------------------------------------------------------------------------------
-- 返回对象
return login_res

-------------------------------------------------------------------------------------