------------------------------------------------------------------------------------
-- game/resources/user_set_res.lua
--
--
--
-- @module      user_set_res
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local user_set_res = import('game/resources/user_set_res')
------------------------------------------------------------------------------------
-- 用户设置资源
local user_set_res = {
    GLOBAL_SET = {
        { session = '副本设置', key = '组队职业分配', value = '其他_2' },
        { session = '副本设置', key = '队长职业', value = '其他' },
        { session = '副本设置', key = '副本组队', value = 1 },
        { session = '副本设置', key = '小号帮打', value = 1 },
        { session = '副本设置', key = '挂机副本', value = '神圣冰川' },
        { session = '主线设置', key = '开启主线', value = 0 },
        { session = '其他设置', key = '下线时间', value = 0 },
        { session = '其他设置', key = '小号等级', value = 0 },
        { session = '其他设置', key = '保留传奇装备', value = 0 },

        --{ session = '副本设置', key = '保留装备', value = '优势大师|无畏酋长' },
        --{ session = '装备设置', key = '01头盔必要保留属性', value = '冷却时间缩减|怒气上限' },
        --{ session = '装备设置', key = '02头盔优先保留属性', value = '近距敌人的伤害减免|伤害减免|强固时伤害减免|远距敌人的伤害减免|总护甲|生命上限' },
        --{ session = '装备设置', key = '03双手锤必要保留属性', value = '暴击伤害|易伤伤害' },
        --{ session = '装备设置', key = '04双手锤优先保留属性', value = '全属性|核心技能伤害|对近距敌人的伤害' },
        --{ session = '装备设置', key = '05单手剑必要保留属性', value = '暴击伤害|易伤伤害' },
        --{ session = '装备设置', key = '06单手剑优先保留属性', value = '全属性|核心技能伤害|对近距敌人的伤害' },
        --{ session = '装备设置', key = '07双手剑优先保留属性', value = '暴击伤害|易伤伤害' },
        --{ session = '装备设置', key = '08双手剑优先保留属性', value = '全属性|核心技能伤害|对近距敌人的伤害' },
        --{ session = '装备设置', key = '09戒指必要保留属性', value = '暴击伤害|易伤伤害|暴击几率' },
        --{ session = '装备设置', key = '10戒指优先保留属性', value = '怒气上限' },
        --{ session = '装备设置', key = '11项链必要保留属性', value = '怒气消耗减免|冷却时间缩减' },
        --{ session = '装备设置', key = '12项链优先保留属性', value = '所有防御技能|近距敌人的伤害减免|移动速度' },
        --{ session = '装备设置', key = '13长靴必要保留属性', value = '移动速度|怒气消耗减免' },
        --{ session = '装备设置', key = '14长靴优先保留属性', value = '全属性|近距敌人的伤害减免' },
        --{ session = '装备设置', key = '15裤子必要保留属性', value = '近距敌人的伤害减免|伤害减免|强固时伤害减免|远距敌人的伤害减免' },
        --{ session = '装备设置', key = '16裤子优先保留属性', value = '' },
        --{ session = '装备设置', key = '17手套必要保留属性', value = '先祖之锤|暴击几率' },
        --{ session = '装备设置', key = '18手套优先保留属性', value = '攻击速度|幸运一击几率|幸运一击:几率恢复主要资源' },
        --{ session = '装备设置', key = '19上衣必要保留属性', value = '' },
        --{ session = '装备设置', key = '20上衣优先保留属性', value = '近距敌人的伤害减免|伤害减免|强固时伤害减免|远距敌人的伤害减免|远距敌人的伤害减免|总护甲' },
    }
}

-- 自身模块
local this = user_set_res

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return user_set_res

-------------------------------------------------------------------------------------